package test;

import java.util.HashMap;
import java.util.Map;

/**
 * @author BMK
 * @Version 1.0
 * @since 2020/11/12 17:40
 */
public class StringUse {
    public static Map<String,String> dataMapTwo= new HashMap<String, String>();
    public static Map<String,String> dataMapThree= new HashMap<String, String>();
    public static Map<String,String> dataMapOne= new HashMap<String, String>();
    public static Map<String,String> dataMapN= new HashMap<String, String>();
    static{
        dataMapTwo.put("text_1","这是");
        dataMapTwo.put("text_2","这是");
        dataMapTwo.put("text_3","这是");
        dataMapTwo.put("text_4","这是一个测试文件");
        dataMapTwo.put("text_5","这是");
        dataMapTwo.put("text_6","这是");
        dataMapTwo.put("text_7","这是");
        dataMapTwo.put("text_8","这是");
        dataMapTwo.put("text_9","这是");
        dataMapTwo.put("text_10","这是");
        dataMapTwo.put("text_11","这是");
        dataMapTwo.put("text_12","这是");
        dataMapTwo.put("text_13","这是");
        dataMapTwo.put("text_14","这是");
        dataMapTwo.put("text_15","这是");
        dataMapTwo.put("text_16","这是");
        dataMapTwo.put("text_17","这是");
        dataMapTwo.put("text_18","1  这是　一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "2这是一个测试文件这是一个测试文件\n" +
                "3这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "4这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "5这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "6这是一个测试文件这是一个测试文件\n" +
                "7这是一个测试文件\n" +
                "8这是一个测试文件" +
                "9这是一个测试文件这是一个测试文件=这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件====这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "10这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "11这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "12这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "13这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "14这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "15这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "16这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "17这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "18这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "19这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "20这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "21这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "22这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "23这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "24这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文"

                );
        dataMapTwo.put("text_19","这是");
        dataMapTwo.put("text_20","这是");
        dataMapTwo.put("text_21","这是");

        dataMapThree.put("text_1","这是");
        dataMapThree.put("text_2","这是");
        dataMapThree.put("text_3","这是");
        dataMapThree.put("text_4","这是一个测试文件");
        dataMapThree.put("text_5","这是");
        dataMapThree.put("text_6","这是");
        dataMapThree.put("text_7","这是");
        dataMapThree.put("text_8","这是");
        dataMapThree.put("text_9","这是");
        dataMapThree.put("text_10","这是");
        dataMapThree.put("text_11","这是");
        dataMapThree.put("text_12","这是");
        dataMapThree.put("text_13","这是");
        dataMapThree.put("text_14","这是");
        dataMapThree.put("text_15","这是");
        dataMapThree.put("text_16","这是");
        dataMapThree.put("text_17","这是");
        dataMapThree.put("text_18","1  这是　一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "2这是一个测试文件这是一个测试文件\n" +
                "3这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "4这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "5这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "6这是一个测试文件这是一个测试文件\n" +
                "7这是一个测试文件\n" +
                "8这是一个测试文件" +
                "9这是一个测试文件这是一个测试文件=这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件====这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "10这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "11这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "12这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "13这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "14这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "15这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "16这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "17这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "18这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "19这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "20这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "21这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "22这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "23这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "24这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n"

        );
        dataMapThree.put("text_19","这是");
        dataMapThree.put("text_20","这是");
        dataMapThree.put("text_21","这是");





        dataMapOne.put("text_1","这是");
        dataMapOne.put("text_2","这是");
        dataMapOne.put("text_3","这是");
        dataMapOne.put("text_4","这是一个测试文件");
        dataMapOne.put("text_5","这是");
        dataMapOne.put("text_6","这是");
        dataMapOne.put("text_7","这是");
        dataMapOne.put("text_8","这是");
        dataMapOne.put("text_9","这是");
        dataMapOne.put("text_10","这是");
        dataMapOne.put("text_11","这是");
        dataMapOne.put("text_12","这是");
        dataMapOne.put("text_13","这是");
        dataMapOne.put("text_14","这是");
        dataMapOne.put("text_15","这是");
        dataMapOne.put("text_16","这是");
        dataMapOne.put("text_17","这是");
        dataMapOne.put("text_18","1  这是　一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "2这是一个测试文件这是一个测试文件\n" +
                "3这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "4这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "5这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "6这是一个测试文件这是一个测试文件\n" +
                "7这是一个测试文件\n" +
                "8这是一个测试文件" +
                "9这是一个测试文件这是一个测试文件=这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件====这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "10这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "11这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文"


        );
        dataMapOne.put("text_19","这是");
        dataMapOne.put("text_20","这是");
        dataMapOne.put("text_21","这是");




        dataMapTwo.put("text_19","这是");
        dataMapTwo.put("text_20","这是");
        dataMapTwo.put("text_21","这是");

        dataMapN.put("text_1","这是");
        dataMapN.put("text_2","这是");
        dataMapN.put("text_3","这是");
        dataMapN.put("text_4","这是一个测试文件");
        dataMapN.put("text_5","这是");
        dataMapN.put("text_6","这是");
        dataMapN.put("text_7","这是");
        dataMapN.put("text_8","这是");
        dataMapN.put("text_9","这是");
        dataMapN.put("text_10","这是");
        dataMapN.put("text_11","这是");
        dataMapN.put("text_12","这是");
        dataMapN.put("text_13","这是");
        dataMapN.put("text_14","这是");
        dataMapN.put("text_15","这是");
        dataMapN.put("text_16","这是");
        dataMapN.put("text_17","这是");
        dataMapN.put("text_18","1  这是　一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "2这是一个测试文件这是一个测试文件\n" +
                "3这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "4这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "5这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "6这是一个测试文件这是一个测试文件\n" +
                "7这是一个测试文件\n" +
                "8这是一个测试文件" +
                "9这是一个测试文件这是一个测试文件=这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件====这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "10这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "11这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "12这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "13这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "14这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "15这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "16这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "17这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "18这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "19这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "20这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "21这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "22这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "23这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件\n" +
                "24这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "25这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "26这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "27这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "28这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "29这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "30这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "31这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "32这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "33这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "34这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "35这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "36这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "37这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "38这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "39这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "40这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "41这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "42这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "43这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n" +
                "44这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件这是一个测试文件之结尾\n"

        );
        dataMapN.put("text_19","这是");
        dataMapN.put("text_20","这是");
        dataMapN.put("text_21","这是");


    }
}
